app/controllers/curryhouses_controller.rb

INSERT INTO "curryhouses" ("updated_at", "title", "postcode", "phone_number", "website", "description", "created_at") VALUES('2009-08-16 15:06:01', 'Test', 'BS7', '', '', '1234', '2009-08-16 15:06:01')
---
  def create
    @curryhouse = Curryhouse.new(params[:curryhouse])

    respond_to do |format|
      if @curryhouse.save

DELETE FROM "curryhouses" WHERE "id" = 1
---
  def destroy
    @curryhouse = Curryhouse.find(params[:id])
    @curryhouse.destroy