app/controllers/events_controller.rb

SELECT * FROM "events"
---
  def index
    @events = Event.all

SELECT * FROM "events" WHERE ("events"."id" = 1)
SELECT * FROM "votes" WHERE ("votes"."userid" IS NULL) LIMIT 1
INSERT INTO "votes" ("created_at", "event_id", "updated_at", "userid", "avail") VALUES('2009-08-24 21:12:40', 1, '2009-08-24 21:12:40', 1, NULL)
UPDATE "votes" SET "avail" = NULL WHERE "id" = 4
---
  def show
    @event = Event.find(params[:id])
    @myvote = Vote.find_by_userid(session[:userid])
    puts @myvote
    if @myvote.nil? then
      @myvote = Vote.new
      @myvote.userid= sesion[:userid]
    end
    puts @myvote
    @myvote.save

SELECT * FROM "events" WHERE ("events"."id" = 1)
---
  def edit
    @event = Event.find(params[:id])

INSERT INTO "events" ("updated_at", "enddate", "votingopen", "startdate", "created_at") VALUES('2009-08-16 13:57:16', '2009-09-16', 'f', '2009-08-16', '2009-08-16 13:57:16')
---
  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save

SELECT * FROM "events" WHERE ("events"."id" = 1)
UPDATE "events" SET "startdate" = '2009-08-27', "updated_at" = '2009-08-24 21:12:13' WHERE "id" = 1
---
  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      @event.curryhouse_ids = params[:event][:curryhouse_ids]
      if @event.update_attributes(params[:event])

SELECT * FROM "events" WHERE ("events"."id" = 953125641)
DELETE FROM "events" WHERE "id" = 953125641
---
  def destroy
    @event = Event.find(params[:id])
    @event.destroy

SELECT * FROM "events" WHERE ("events"."id" = 1)
UPDATE "events" SET "votingopen" = 't', "updated_at" = '2009-08-16 13:57:26' WHERE "id" = 1
---
  def openvoting
  	@event = Event.find(params[:id])
	@event.votingopen = true
	@event.save

SELECT * FROM "events" WHERE ("events"."id" = 1)
UPDATE "events" SET "updated_at" = '2009-08-24 21:15:05', "votingopen" = 'f' WHERE "id" = 1
---
  def closevoting
  	@event = Event.find(params[:id])
	@event.votingopen = false
	@event.save

SELECT * FROM "events" WHERE ("events"."id" = 1)
SELECT "curryhouses".id FROM "curryhouses" INNER JOIN "curryhouses_votes" ON "curryhouses".id = "curryhouses_votes".curryhouse_id WHERE ("curryhouses_votes".vote_id = 1 )
SELECT * FROM "votes" WHERE ("votes"."id" IN (5,6))
---
  def results
  	@event = Event.find(params[:id])
	vote_results = Array.new
	@event.curryhouses.each do |curryhouse|
		count = 0
	        Vote.find(@event.votes).map(&:curryhouse_ids).flatten!.each { |v| count = count +1 if v==curryhouse.id } rescue nil