app/controllers/votes_controller.rb

  def load_event
    @event = Event.find(params[:event_id])
---
SELECT * FROM "events" WHERE ("events"."id" = 1)

  def index
    @votes = Vote.find(:all, :conditions => {:event_id => @event} )
---
SELECT * FROM "votes" WHERE ("votes"."event_id" = 1)

  def show
    @vote = Vote.find(params[:id], :conditions => { :event_id => @event } )
---
SELECT * FROM "votes" WHERE ("votes"."id" = 2 AND ("votes"."event_id" = 1))

  def edit
    @vote = Vote.find(params[:id])
---
SELECT * FROM "votes" WHERE ("votes"."id" = 4)

  def create
    @vote = Vote.new(params[:vote])
    @vote.event = @event
    @vote.curryhouse_ids = params[:vote][:curryhouse_ids]
    respond_to do |format|
      if @vote.save
---
INSERT INTO "votes" ("event_id", "updated_at", "userid", "created_at") VALUES(1, '2009-08-16 14:37:02', NULL, '2009-08-16 14:37:02')

  def update
    @vote = Vote.find(params[:id])

    respond_to do |format|
      if @vote.update_attributes(params[:vote])
---
SELECT * FROM "votes" WHERE ("votes"."id" = 1)
UPDATE "votes" SET "updated_at" = '2009-08-24 21:06:43', "avail" = '---

  def destroy
    @vote = Vote.find(params[:id])
    @vote.destroy
---
SELECT * FROM "votes" WHERE ("votes"."id" = 1)
DELETE FROM "votes" WHERE "id" = 1